import math


def area(r):
    '''
    Считает площадь круга по его радиусу.

    Параметры:
        r (float): радиус круга

    Возвращаемое значение:
        float: площадь круга

    Пример вызова:
        area(3)  # 28.274333882308138
    '''
    return math.pi * r * r


def perimeter(r):
    '''
    Считает длину окружности по её радиусу.

    Параметры:
        r (float): радиус окружности

    Возвращаемое значение:
        float: длина окружности

    Пример вызова:
        perimeter(5)  # 31.41592653589793
    '''
    return 2 * math.pi * r
