def area(a, b):
    '''
    Считает площадь прямоугольника по двум его сторонам.

    Параметры:
        a (float): длина первой стороны
        b (float): длина второй стороны

    Возвращаемое значение:
        float: площадь прямоугольника

    Пример вызова:
        area(4, 5)  # 20
    '''
    return a * b


def perimeter(a, b):
    '''
    Считает периметр прямоугольника по двум его сторонам.

    Параметры:
        a (float): длина первой стороны
        b (float): длина второй стороны

    Возвращаемое значение:
        float: периметр прямоугольника

    Пример вызова:
        perimeter(4, 5)  # 18
    '''
    return 2 * (a + b)
