
def area(a):
    '''
    Считает площадь квадрата по длине его стороны.

    Параметры:
        a (float): длина стороны квадрата

    Возвращаемое значение:
        float: площадь квадрата

    Пример вызова:
        area(3)  # 9
    '''
    return a * a


def perimeter(a):
    '''
    Считает периметр квадрата по длине его стороны.

    Параметры:
        a (float): длина стороны квадрата

    Возвращаемое значение:
        float: периметр квадрата

    Пример вызова:
        perimeter(3)  # 12
    '''
    return 4 * a
